#### UIThemeManager Members

---

|  |
| --- |
| UIThemeManager Class   Methods   Properties   See Also |

The  UIThemeManager  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | GetThemeName | Gets the theme name for the given theme type. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | CurrentTheme | The current theme. |
| Public property Static member | DefaultTheme | The default theme. |

# See Also

UIThemeManager Class

Autodesk.Revit.UI Namespace